artillery/config.fuzzer.yaml

config:
  target: 'http://host.docker.internal:3001'
  phases:
    - arrivalCount: 10
      arrivalRate: 20
      duration: 30
  environments:
    localhost:
      target: 'http://localhost:3001'
    indocker:
      target: 'http://host.docker.internal:3001'
    production:
      target: 'https://quiz.wetsnow.com'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  plugins:
    expect: {}
    fuzzer: {}
